{
    "Вступ":"\n\nОбчислення можуть зайняти кілька секунд. \n\n\nДля застосування частотних фільтрів до світлини застосовується дискретне перетворення Фур'є. \n\n\n:red[Зверніть увагу! Якщо завантажене зображення кольорове і Ви обираєте виконати наступні дії з його чорно-білою версією, результат не можна буде повернути до формату RGB.] ",
    "RGB":"Зображення спектру певною мірою вказують, 'скільки' тої чи іншої частотної компоненти присутньо на фото. Всі вони відображені на логарифмічній шкалі. Вони також зміщені, щоб нижчі частоти було розташовано ближче до центру. \n\n\nСправа наведено спектр величин, отриманий після застосування перетворення Фур'є до усіх трьох каналів кольорового зображення. Нижче додано спектри для кожного з них окремо. Канал R (red) відповідає за присутність червоного кольору на світлині, канали G (green) та B (blue) - за присутність зеленого та блакитного кольорів відповідно. Фільтри, які Ви маєте можливість застосувати нижче, застосовуються до усіх трьох каналів.",
    "Про фільтри":{
        "Загальне": ":red[Зверніть увагу!] Низькі частоти (ближчі до центру спектру) відповідають за повільні, поступові зміни – це великі однорідні області, плавні градієнти чи м’які переходи яскравості. Високі частоти (віддалені від центру спектру) на фото відображають різкі зміни інтенсивності, такі як у дрібних деталей у просторовій області. Також вони можуть відображати шум.",
        "З ідеальним зрізом | З пропуском низьких частот":{
            "Про фільтр":"***Фільтр ідеального зрізу з пропуском низьких частот*** знизить елементи спектру, що розташовані далі від центру, ніж задане значення зрізу. Решта частот залишаться незмінними.",
            "Про параметри":"Значення частоти відповідає за те, наскільки близько до центру спектру пройде зріз. Ви можете задати значення у відсотках від 1 до 99. Чим нижче це значення, тим більш розмитим буде результат.",
            "Альтернативи":"Якщо Ви хочете, щоб розмиття було більш плавним, оберіть фільтри з пропуском низьких частот Гауса чи Баттерворта. Смугові фільтри (2) також забезпечать розмиття, вони впливають на середні частоти, залишаючи найнижчі та найвищі. Фільтри Лапласа та Лапласа від Гауса підсилюють високі частоти, а не знижують їх, результатом є виділення контурів. Для виділення країв також підійдуть фільтри з пропуском високих частот або смугові фільтри (1)."
        },
        
        "З ідеальним зрізом | З пропуском високих частот": {
            "Про фільтр": "***Фільтр ідеального зрізу з пропуском високих частот*** повністю усуває низькі частоти (ближче до центру спектру), зберігаючи високі частоти незмінними. Такий фільтр виділяє деталі, краї та різкі переходи інтенсивності.",
            "Про параметри": "Параметр зрізу визначає радіус області, що буде обнулена. Чим більше значення, тим агресивніше будуть пригнічені низькі частоти.",
            "Альтернативи": "Якщо Вам потрібне більш м’яке або природне підсилення контурів, оберіть Гаусовий або Баттервортівський фільтр з пропуском високих частот. Для ще сильнішого виділення країв спробуйте фільтр Лапласа або Лапласа від Гауса."
        },
    
        "З ідеальним зрізом | Смуговий 1": {
            "Про фільтр": "***Смуговий фільтр типу 1 (ідеального зрізу)*** усуває частоти всередині заданої смуги, залишаючи інші частоти незмінними. Він дозволяє відфільтрувати певний діапазон частот, які відповідають середнім деталям.",
            "Про параметри": "Ви можете задати значення центру та середини смуги у відсотках від 1 до 99. Чим нижче значення центру і чим ширша смуга, тим більш розмитим буде результат.",
            "Альтернативи": "Якщо потрібне плавніше пригнічення середніх частот — оберіть фільтри Гауса чи Баттерворта. Якщо хочете навпаки пропустити середні частоти — використовуйте смуговий фільтр типу 2."
        },
    
        "З ідеальним зрізом | Смуговий 2": {
            "Про фільтр": "***Смуговий фільтр типу 2 (ідеальний)***  пригнічує всі частоти, крім тих, що лежать у заданій смузі. Це дозволяє виділити частоти середнього діапазону. Результатом у просторовому домені будуть виділені краї",
            "Про параметри": "Ви можете задати значення центру та середини смуги у відсотках від 1 до 99. Чим більша ширина, тим більше частот буде пропущено.",
            "Альтернативи": "Для природнішого пропускання середніх частот використовуйте Гаусів або Баттерворт. Якщо потрібно прибрати середні частоти, а не виділити їх — оберіть смуговий фільтр типу 1."
        },
    
        "Гауса | З пропуском низьких частот": {
            "Про фільтр": "***Гаусовий фільтр з пропуском низьких частот*** плавно зменшує значення високих частот, не створюючи різкого зрізу. Це забезпечує м’яке, природне розмиття з мінімумом артефактів.",
            "Про параметри": "Параметр зрізу визначає, наскільки далеко від центру вплив фільтра стає значним. Вищі значення дають менше розмиття.",
            "Альтернативи": "Якщо потрібен сильніший ефект — оберіть Баттерворт. Для максимального придушення без плавності — фільтр ідеального зрізу."
        },
    
        "Гауса | З пропуском високих частот": {
            "Про фільтр": "***Гаусовий фільтр з пропуском високих частот*** пригнічує низькі частоти, зберігаючи високі. Дає більш м’яке й природне виділення країв без різких артефактів.",
            "Про параметри": "Параметр зрізу визначає радіус впливу. Чим менший радіус, тим більш контрастні краї.",
            "Альтернативи": "Для більш різкого виділення деталей використовуйте ідеальний фільтр з пропуском високих частот або фільтр Лапласа (у переліку фільтрів з пропуском низьких частот). Для регульованої різкості виділених країв підійде фільтр Баттерворта з пропуском високих частот."
        },
    
        "Гауса | Смуговий 1": {
            "Про фільтр": "***Гаусовий смуговий фільтр типу 1*** пригнічує частоти навколо заданого центру смуги більш плавно, ніж ідеальний, залишаючи найнижчі та найвищі частоти.",
            "Про параметри": "Ви можете задати значення центру та середини смуги у відсотках від 1 до 99. Чим ширша смуга, тим більш плавний перехід.",
            "Альтернативи": "Якщо Вам потрібне чітке обрізання частот оберіть ідеальний смуговий фільтр 1. Для складнішої регуляції крутості зрізу підійде Баттерворт."
        },
    
        "Гауса | Смуговий 2": {
            "Про фільтр": "***Гаусовий смуговий фільтр типу 2*** пропускає частоти навколо d0, пригнічуючи низькі та високі частоти плавно й без різких переходів.",
            "Про параметри": "Ви можете задати значення центру та середини смуги у відсотках від 1 до 99. Чим ширша смуга, тим більш плавний перехід.",
            "Альтернативи": "Для більш різкої ізоляції частот використовуйте фільтр ідеального зрізу."
        },
    
        "Баттерворта | З пропуском низьких частот": {
            "Про фільтр": "***Фільтр Баттерворта з пропуском низьких частот*** забезпечує плавне, але більш кероване зниження високих частот порівняно з Гаусовим. Відрізняється можливістю задавати порядок, який визначає крутизну кривої.",
            "Про параметри": "Параметр зрізу визначає, наскільки далеко від центру вплив фільтра стає значним. Вищі значення дають менше розмиття. Чим вищий порядок фільтра, тим крутіший перехід між низькими та високими частотами.",
            "Альтернативи": "Для максимально плавного згладжування використовуйте фільтр Гауса. Для різкого зрізу — фільтр ідеального зрізу."
        },
    
        "Баттерворта | З пропуском високих частот": {
            "Про фільтр": "***Фільтр Баттерворта з пропуском високих частот*** плавно, але агресивніше, ніж Гаусовий фільтр, пригнічує низькі частоти. Дозволяє краще контролювати підсилення країв.",
            "Про параметри": "Параметр зрізу визначає радіус області, що буде придушена найбільше. Чим більше значення, тим агресивніше будуть пригнічені низькі частоти. Більший порядок фільтра дає різкіший контур.",
            "Альтернативи": "Для більш м’якого виділення країв використовуйте Гаусовий фільтр. Для максимальної різкості — фільтр Лапласа."
        },
    
        "Баттерворта | Смуговий 1": {
            "Про фільтр": "***Смуговий фільтр Баттерворта типу 1*** пригнічує середні частоти плавно, але з можливістю контролю плавності через параметр порядку. Артефактів повинно бути менше, ніж в ідеальному фільтрі.",
            "Про параметри": "Ви можете задати значення центру та середини смуги у відсотках від 1 до 99. Чим ширша смуга, тим більш плавний перехід. Порядок визначає крутизну переходу.",
            "Альтернативи": "Якщо потрібне максимально плавне пригнічення, оберіть Гаусовий фільтр. Якщо навпаки, різке — потрібен фільтр ідеального зрізу."
        },
    
        "Баттерворта | Смуговий 2": {
            "Про фільтр": "***Смуговий фільтр Баттерворта типу 2*** пропускає частоти навколо центру смуги і пригнічує низькі та високі частоти з регульованою крутизною.",
            "Про параметри": "Вищий порядок дає чистіший контраст.",
            "Альтернативи": "Для м’якого пропускання використовуйте фільтр Гауса. Для повного відрізання частот - фільтр ідеального зрізу."
        },
    
        "Лапласа | З пропуском низьких частот": {
            "Про фільтр": "***Фільтр Лапласа*** підсилює високі частоти, тобто різкі зміни інтенсивності. У частотній області він діє як підсилювач країв. Забезпечує виділення усіх деталей, але резальтат з високою імовірністю буде містити шум.",
            "Про параметри": "",
            "Альтернативи": "Якщо потрібен більш м’який або стабільний результат, де не буде стільки шуму, оберіть фільтр Лапласа від Гауса. Для простого підсилення контурів — фільтри з пропуском високих частот чи смугові фільтри (1)."
        },
    
        "Лапласа від Гауса | З пропуском низьких частот": {
            "Про фільтр": "***Фільтр Лапласа від Гауса (LoG)*** поєднує підсилення країв та їх згладжування. Гаус спочатку згладжує шум, а Лаплас виділяє краї. Результат — акуратне, чисте виділення контурів.",
            "Про параметри": "Чим вище буде значення зрізу, тим більше деталей залишаться неушкодженими.",
            "Альтернативи": "Для більш різкого виділення використовуйте фільтр Лапласа. Іншими альтренативами також є фільтри з пропуском високих частот та смугові (1), що також працюють для виділення контурів."
        }
    }
}